; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-1-1-2-261)
	(:domain driverlog)
	(:objects
	driver1 - driver
	truck1 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	p1-0 - location
	p1-2 - location
	p1-3 - location
	p2-3 - location
	)
	(:init
	(at driver1 s3)
	(at truck1 s0)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at package1 s2)
	(at package2 s0)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 61)
	(= (time-to-walk p1-0 s1) 61)
	(= (time-to-walk s0 p1-0) 60)
	(= (time-to-walk p1-0 s0) 60)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 12)
	(= (time-to-walk p1-2 s1) 12)
	(= (time-to-walk s2 p1-2) 38)
	(= (time-to-walk p1-2 s2) 38)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 50)
	(= (time-to-walk p1-3 s1) 50)
	(= (time-to-walk s3 p1-3) 26)
	(= (time-to-walk p1-3 s3) 26)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 14)
	(= (time-to-walk p2-3 s2) 14)
	(= (time-to-walk s3 p2-3) 53)
	(= (time-to-walk p2-3 s3) 53)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 4)
	(= (time-to-drive s1 s2) 4)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 7)
	(= (time-to-drive s1 s3) 7)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 24)
	(= (time-to-drive s2 s3) 24)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 36)
	(= (time-to-drive s1 s0) 36)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 44)
	(= (time-to-drive s2 s0) 44)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at package1 s1)
	(at package2 s3)
	))

(:metric minimize (+ (* 2 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (walk driver1 s3 p2-3)
   deleted: (at driver1 s3)
   added: (at driver1 p2-3)
   goals met: 0 of 3
2. (walk driver1 p2-3 s2)
   deleted: (at driver1 p2-3)
   added: (at driver1 s2)
   goals met: 1 of 3
3. (load-truck package2 truck1 s0)
   deleted: (at package2 s0)
   added: (in package2 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 1 of 3
4. (walk driver1 s2 p1-2)
   deleted: (at driver1 s2)
   added: (at driver1 p1-2)
   goals met: 0 of 3
5. (walk driver1 p1-2 s1)
   deleted: (at driver1 p1-2)
   added: (at driver1 s1)
   goals met: 0 of 3
6. (walk driver1 s1 p1-0)
   deleted: (at driver1 s1)
   added: (at driver1 p1-0)
   goals met: 0 of 3
7. (walk driver1 p1-0 s0)
   deleted: (at driver1 p1-0)
   added: (at driver1 s0)
   goals met: 0 of 3
8. (board-truck driver1 truck1 s0)
   deleted: (at driver1 s0) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 0 of 3
9. (drive-truck truck1 s0 s2 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 0 to 484
   goals met: 0 of 3
10. (load-truck package1 truck1 s2)
   deleted: (at package1 s2)
   added: (in package1 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 0 of 3
11. (drive-truck truck1 s2 s1 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 484 to 536
   goals met: 0 of 3
12. (unload-truck package1 truck1 s1)
   deleted: (in package1 truck1)
   added: (at package1 s1)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 1 of 3
13. (drive-truck truck1 s1 s3 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   changed: (fuel-used) from 536 to 613
   goals met: 1 of 3
14. (unload-truck package2 truck1 s3)
   deleted: (in package2 truck1)
   added: (at package2 s3)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 2 of 3
15. (drive-truck truck1 s3 s2 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (fuel-used) from 613 to 853
   goals met: 2 of 3
16. (disembark-truck driver1 truck1 s2)
   deleted: (driving driver1 truck1)
   added: (at driver1 s2) (empty truck1)
   goals met: 3 of 3
